Repository: klopfdreh/spring-cloud-dataflow-ui
Catalog: ui/src/locale/messages.*.xlf
Languages: de

source: About Spring Cloud Data Flow
de: Über Spring Cloud Data Flow

source: Data Flow Server Implementation
de: Data Flow Server Implementierung

source: Tasks:
de: Aufgaben:

source: Schedules:
de: Zeitpläne:

source: Security
de: Sicherheit

source: Authentication Enabled:
de: Authentifizierung Aktiviert:

source: Authenticated:
de: Authentifiziert:

source: Username:
de: Benutzername:

source: Roles:
de: Rollen:

source: Versions
de: Versionen

source: Implementation Version:
de: Implementierungs Versionen:

source: Shell Checksum Sha1:
de: Shell Prüfsumme Sha1:

source: Shell Checksum Sha256:
de: Shell Prüfsumme Sha256:

source: Runtime Environment - Skipper Deployer
de: Laufzeit Umgebung - Skipper Deployer

source: Platform Api Version:
de: Plattform Api Version:

source: Platform Client Version:
de: Plattform Client Version:

source: Platform Host Version:
de: Plattform Host Version:

source: Platform Type:
de: Plattform Type:

source: Platform-specific Information of the Skipper Deployer
de: Plattformspezifische Informationen vom Skipper Deployer

source: No platform-specific app deployer information available.
de: Keine Plattformspezifische Anwendungs-Deployer-Informationen verfügbar.

source: Runtime Environment - Task Launcher
de: Laufzeit-Umgebung - Aufgaben-Launcher

source: No Task Launcher information is available.
de: Keine Aufgaben-Launcher-Information verfügbar.

source: Platform-specific Information of the Task Launcher
de: Plattformspezifische Informationen vom Aufgaben-Launcher

source: No platform-specific task launcher information available.
de: Keine Plattformspezifische Aufgaben-Launcher-Informationen verfügbar.

source: Need Help or Found an Issue?
de: Brauchen Sie Hilfe oder haben Sie einen Fehler gefunden?

source: Project Page
de: Projekt Seite

source: Quick overview of Spring Cloud Data Flow Project.
de: Schnell-Übersicht über das Spring Cloud Data Flow Projekt.

source: Source Code
de: Quellcode

source: Spring Cloud Data Flow Project is an Open Source Project.
de: Spring Cloud Data Flow Projekt ist ein Open Source Projekt.

source: Documentation
de: Dokumentation

source: Learn more about the product features.
de: Lernen Sie mehr über die Produkt-Features.

source: Learn more about the REST-APIs.
de: Lernen Sie mehr über die REST-APIs.

source: You need help?
de: Benötigen Sie Hilfe?

source: Report an issue or request for a new feature.
de: Melden Sie einen Fehler oder erfragen Sie ein neues Feature.

source: Copy Details to Clipboard
de: Kopiere Details in die Zwischenablage

source: Copy to clipboard
de: In die Zwischenablage kopieren

source: Copied About Details to Clipboard (As JSON).
de: Kopiere Über-Details in die Zwischenablage (Als JSON).

source: Data Flow Server Implementation
de: Data Flow Server Implementierung

source: More info
de: Mehr Infos

source: Project Page
de: Projekt Seite

source: Source Code
de: Quellcode

source: Issue Tracker
de: Fehler Tracker

source: Log out
de: Ausloggen

source: Log In
de: Einloggen

source: Welcome to
de: Willkommen zu

source: You have to log in to access the application.
de: Sie müssen sich einloggen um Zugang zu der Anwendung zu erhalten.

source: Register one or more applications
de: Eine oder mehrere Anwendungen registrieren

source: Import application coordinates from an HTTP URI location
de: Anwendung von einer HTTP URI Zielkoordinate importieren

source: Import application coordinates from a properties file
de: Anwendung von einer Properties-Datei importieren

source: Import application starters from dataflow.spring.io.
de: Anwendung von dataflow.spring.io starter importieren.

source: Enter the list of properties into the text area field below.
de: Geben Sie eine Liste von Eigenschaften in das hier drunter liegende Textfeld ein.

source: Alternatively, you can also select a file in your local file system, which is used to populate the text area field.
de: Alternativ können Sie eine Datei von dem lokalen Dateisystem wählen welches in das Textfeld eingefügt wird.

source: Apps as Properties
de: Anwendungen als Properties

source: Example:
de: Beispiel:

source: One or more application(s) are required.
de: Eine oder mehrere Anwendungen sind benötigt.

source: Force, the applications will be imported and installed even if it already exists but only if not being used already.
de: Forcieren, Anwendungen werden importiert und installiert auch wenn sie bereits existieren aber nicht verwendet werden.

source: Cancel
de: Abbrechen

source: Import Application(s)
de: Importiere Anwendung(en)

source: Import application(s)
de: Importiere Anwendung(en)

source: Importing application(s)...
de: Importiere Anwendung(en)...

source: Cancel
de: Abbrechen

source: Invalid field(s)
de: Ungültige(s) Feld(er)

source: Some field(s) are missing or invalid.
de: Einige Felder fehlen oder sind nicht gültig.

source: Application(s) Imported.
de: Anwendungen importiert.

source: An error occurred
de: Ein Fehler ist aufgetreten

source: An error occurred while importing Apps. Please check the server logs for more details.
de: Ein Fehler ist während des Importierens der Anwedungen aufgetreten. Bitte die Server-Logs für mehr Informationen einsehen.

source: Register one or more applications by entering a
de: Eine oder mehr Anwendungen registrieren unter angabe von

source: Type
de: Typ

source: and
de: und

source: of the application Jar. You can also provide an optional
de: von der Anwendungs Jar. Sie können auch ein optionales angeben

source: metadata artifact URI
de: Metadaten Artefakt URI

source: The App
de: Die App

source: the
de: die

source: Metadata Artifact URI
de: Metadaten Artefakt URI

source: are typically provided using the Maven coordinates of the Jar but can be a local file or a docker image URI.
de: werden typischerweise zur Verfügung gestellt unter verwendung der Maven Koordinaten der Jar, können jedoch auch über eine lokale Datei oder eine Docker Image URI zur Verfügung gestellt werden.

source: Please provide a valid name for the app.
de: Bitte geben Sie einen gültigen Namen der Anwendung an.

source: Please provide a valid type.
de: Bitte geben Sie einen gültigen Typ an.

source: Please provide a valid URI pointing to the respective properties file.
de: Bitte geben sie eine gültige URI an, welche auf eine Properties Datei verweist.

source: Metadata URI
de: Metadaten URI

source: Force, the applications will be imported and installed even if it already exists but only if not being used already.
de: Forcieren, Anwendungen werden importiert und installiert auch wenn sie bereits existieren aber nicht verwendet werden.

source: Remove
de: Entfernen

source: New application
de: Neue Anwendung

source: Import application(s)
de: Importiere Anwendung(en)

source: Register application(s)
de: Registriere Anwendung(en)

source: Registering application(s)...
de: Registriere Anwendung(en)...

source: Invalid application
de: Ungültige Anwendung

source: Please, register at least one application.
de: Bitte registrieren Sie zu mindestens eine Anwendung.

source: Invalid application(s)
de: Ungültige Anwendung(en)

source: Register application(s).
de: Registriere Anwendung(en).

source: App(s) registered.
de: Anwendung(en) registriert.

source: Provide a URI that points to the location of the properties file.
de: Geben Sie eine URI an die auf eine Properties Datei verweist.

source: This properties file is formatted so that the keys represent the type and the name of the application, e.g. type.name. The property values are the URIs of the app.
de: Die Properties Datei ist formatiert, sodass jeder Schlüssel einen Typen und den Namen der Anwendung representiert, z.B. type.name. Die Werte sind die URIs der Anwendungen.

source: e.g.:
de: z.B.:

source: Force, the applications will be imported and installed even if it already exists but only if not being used already.
de: Forcieren, Anwendungen werden importiert und installiert auch wenn sie bereits existieren aber nicht verwendet werden.

source: Invalid field
de: Ungültiges Feld

source: Use predefined application-URIs (for either maven or docker) for all the out-of-the-box stream and task/batch apps.
de: Benutze vordefinierte Anwendungs-URIs (für Maven oder Docker) für alle out-of-the-box Stream/Aufgaben/Batch-Anwendungen.

source: Stream application starters for Kafka/Maven
de: Stream Anwendungen-Starter für Kafka/Maven

source: Stream application starters for Kafka/Docker
de: Stream Anwendungen-Starter für Kafka/Docker

source: Stream application starters for RabbitMQ/Maven
de: Stream Anwendungen-Starter für RabbitMQ/Maven

source: Stream application starters for RabbitMQ/Docker
de: Stream Anwendungen-Starter für RabbitMQ/Docker

source: Task application starters for Maven
de: Aufgaben Anwendungen-Starter für Maven

source: Task application starters for Docker
de: Aufgaben Anwendungen-Starter für Docker

source: No starter selected
de: Keine Starter ausgewählt

source: Please, select a starter pack.
de: Bitte wählen Sie ein Starter Paket aus.

source: Import starters
de: Importiere Starter

source: Unregister Application
de: Deregistriere Anwendung

source: Manage versions
de: Verwalte Versionen

source: (DEFAULT)
de: (VOREINSTELLUNG)

source: Metadata Uri
de: Metadaten Uri

source: Version(s)
de: Version(en)

source: Loading information...
de: Lade Informationen...

source: There are
de: Es gibt

source: more than 50 properties
de: mehr als 50 Eingeschaften

source: to display, the UI can be slow.
de: zum Anzeigen kann die UI etwas langsam sein.

source: Do you want to
de: Möchten Sie

source: display all the properties
de: alle Eingeschaften anzeigen

source: Show all the properties
de: Zeige alle Eingeschaften

source: Deprecation level:
de: Veraltungs-Level:

source: Default value:
de: Ursprungs-Wert:

source: No property
de: keine Eigenschaft

source: Loading properties...
de: Lade Eingeschaften...

source: Loading application...
de: Lade Anwendung...

source: No application found.
de: Keine Anwendung gefunden.

source: Applications
de: Anwendungen

source: Add application(s)
de: Anwendung(en) hinzufügen

source: Unregister application(s)
de: Deregistriere Anwendung(en)

source: Group Actions
de: Gruppen Aktionen

source: Refresh
de: Aktualisieren

source: Type
de: Typ

source: Metadata URI
de: Metadaten URI

source: Manage Version
de: Version Verwalten

source: Unregister
de: Deregistrieren

source: No results found.
de: Keine Ergebnisse gefunden.

source: Applications per page
de: Anwendung(en) pro Seite

source: of
de: von

source: applications
de: Anwendungen

source: Confirm Unregister Application
de: Bestätige Deregistrierung der Anwendung

source: Confirm Unregister Applications
de: Bestätige Deregistrierung der Anwendungen

source: This action will unregister and delete application
de: Diese Aktion wird die Anwendung deregistrieren und löschen

source: of type
de: der Wertes

source: Are you sure?
de: Sind Sie sicher?

source: This action will unregister and delete the application(s)
de: Diese Aktion wird die Anwendung(en) deregistrieren und löschen

source: listed below.
de: unterhalb aufgeführt.

source: Unregistering application(s) ...
de: Deregistriere Anwendung(en) ...

source: Unregister the application
de: Deregistriere die Anwendung

source: Unregister the applications
de: Deregistriere die Anwendungen

source: Unregister application
de: Deregistriere Anwendung

source: Successfully removed app "
de: Anwendung wurde erfolgreich entfernt "

source: " of type "
de: " des Types "

source: Unregister applications
de: Deregistriere Anwedungen

source: app(s) unregistered.
de: Anwedungen(en) deregistriert.

source: Manage versions
de: Versionen verwalten.

source: Unregister
de: Deregistrieren

source: Set default
de: Standard-Wert setzen

source: Loading versions(s) ...
de: Lade Version(en) ...

source: This action will unregister the
de: Diese Aktion wird die Deregistrierung der

source: of the application
de: der Anwendung vornehmen

source: This action will make the version
de: Diese Aktion wird die Version

source: as the default version for the application
de: als Standard-Version der Anwendung festlegen

source: Unregister version
de: Deregistriere Version

source: Successfully removed version "
de: Version wurde erfolgreich entfernt "

source: Default version
de: Standard-Version

source: The version <strong>PH</strong> is now the default version of the application <strong>PH_1</strong> (PH_2).
de: Die Version <strong>PH</strong> ist nun als Standard-Version der Anwedungen <strong>PH_1</strong> (PH_2) festgelegt.

source: Loading...
de: Lade...

source: Update
de: Aktualisiere

source: Invalid value.
de: Ungültiger Wert.

source: No valid value set
de: Kein gültiger Wert gesetzt

source: Value must be set!
de: Wert muss gesetzt sein!

source: Please, enter one or more valid streams.
de: Bitte geben sie einen oder mehere gültige Streams an.

source: Should direct its output to an app
de: Soll die Ausgabe in die Anwendung überführen

source: Should have an input connection from an app
de: Soll die Eingabe mit der Anwendung verknüpfen

source: Destination should be named
de: Ziel muss benannt werden

source: Cannot tap into a destination app
de: Kann nicht in Ziel-Anwendung springen

source: Cannot tap into a tap source
de: Kann nicht in die Quelle springen

source: Sources must appear at the start of a stream
de: Quellen müssen am Start des Streams aufgeführt werden

source: Sink should be at the end of a stream
de: Sink sollten am Ende des Streams sein

source: Only one non-tap link allowed from source
de: Nur ein "Non-Tap-Link" einer Quelle erlaubt

source: Only one non-tap link allowed from processor
de: Nur ein "Non-Tap-Link" eines Processors erlaubt

source: Element needs exactly one non-tapping output connection
de: Element benötigt genau eine "Non-Tap-Output"-Verbindung

source: Input should come from one app only
de: Eingabe sollte nur von einer Anwendung kommen

source: Task should be at the end of a stream
de: Aufgabe sollte am Ende eines Streams kommen

source: Cannot tap into a task app
de: Kann nicht in die Aufgaben-Anwendung springen

source: Tap must appear at the start of a stream
de: Tap muss am Anfang eines Streams kommen

source: Invalid incoming link(s)
de: Ungültige(r) eingehende(r) Link(s)

source: Invalid outgoing link(s)
de: Ungültige(r) ausgehende(r) Link(s)

source: Unknown element '
de: Unbekanntes Element '

source: from group '
de: von der Gruppe '

source: App instance either is down or not deployed
de: Anwendungs instanz ist nicht deployed oder runter gefahren

source: Tap into an existing app
de: Tap in eine bestehende Anwendung

source: Source Destination Name
de: Quell Ziel Name

source: the identifier of the producer endpoint in a stream in the form <stream-name>.<app/app-name>
de: der Identifier von dem Producer-Endpunkt in einem Stream in Form von <stream-name>.<app/app-name>

source: A destination channel that can be used as a source or a sink
de: Ein Ziel-Kanal der als Quelle oder Sink verwendet werden kann.

source: the input/output destination name
de: Der Eingabe/Ausgabe Zielname

source: Invalid stream name!
de: Ungültiger Streamname!

source: Stream name already exists!
de: Streamname gibt es bereits!

source: Stream name already exists on the canvas
de: Streamname gibt es bereits auf der Leinwand

source: Label of the app
de: Etikett von der Anwedung

source: The name of the stream started by this app
de: Der Name des Streams, welcher von dieser Anwedung gestartet wurde

source: Fit to Content
de: Dem Inhalt anpassen

source: Loading editor...
de: Lade Editor...

source: links with Exit Status
de: Links mit Exit Status

source: . Should only be one such link
de: . Sollte nur ein solcher Link sein

source: node can only have outgoing links
de: Knoten kann nur ausgehende Links haben

source: Links from START should not specify an Exit Status
de: Links vom START sollten keinen Exit Status spezifiziert haben

source: End state does not have anything leading to it
de: Es führt nichts zum Ende-Status

source: Must have incoming links
de: Muss eingehende Links haben

source: Must have outgoing links
de: Muss ausgehende Links haben

source: Links should not specify an Exit Status
de: Links sollten keinen Exit-Status spezifiziert haben

source: Must have an incoming link
de: Muss eingehende Links haben

source: Must have an outgoing link
de: Muss ausgehende Links haben

source: Must have at least one outgoing link with no Exit Status condition specified
de: Muss mindestens einen ausgehenden Link ohne Exist-Status Bedingung spezifiziert haben

source: Start element for the composed task. Global options for the task are set on this element.
de: Start-Element für eine zusammengestellte Aufgabe. Globale Optionen für die Aufgabe werden bei diesem Element gesetzt.

source: End element for a flow or the entire composed task.
de: Endelement für einen "Flow" oder die gesammten zusammgestellte Aufgabe.

source: After a split, a sync node pulls the threads of parallel tasks back together
de: Nach einer Aufteilung zieht ein Synchronisierungs-Knoten Stränge parallel laufender Aufgaben zusammen

source: Transition between tasks
de: Übergang zweier Aufgaben

source: Exit status triggering transition to alternate task flow route
de: Exit-Status löst Übergange zu alternativen Aufgaben-Flow-Routen aus

source: Properties for
de: Eigenschaften für

source: Multi-line task definitions are not supported
de: Mehrzeilige Aufgaben-Definitionen sind nicht unterstützt

source: Runtime
de: Laufzeit

source: Tasks / Jobs
de: Aufgabe / Jobs

source: Tasks
de: Aufgabe

source: Tasks executions
de: Aufgaben-Ausführungen

source: Jobs executions
de: Job-Ausführungen

source: Schedules
de: Zeitpläne

source: Manage
de: Verwalten

source: Audit Records
de: Audit Einträge

source: All actions
de: Alle Aktionen

source: All operations
de: Alle Operationen

source: Created On
de: Erstellen auf

source: Actions
de: Aktionen

source: Operations
de: Operationen

source: Operation ID
de: Operations-ID

source: Create by
de: Erstellt von

source: Platform name
de: Plattform-Name

source: Record
de: Eintrag

source: Property
de: Eingeschaft

source: Created On
de: Erstellen auf

source: Data
de: Daten

source: Records per page
de: Einträge pro Seite

source: records
de: Einträge

source: Confirm Clean Up Task Execution(s)
de: Bestätige Aufräumen der Aufgaben-Ausführung(en)

source: This action will remove
de: Diese Aktion entfernt

source: execution(s)
de: Ausführung(en)

source: Are you sure?
de: Sind Sie sicher?

source: Removing data...
de: Entferne Daten...

source: Clean up Execution(s)
de: Aufräumen der Ausführung(en)

source: No execution
de: Keine Ausführung

source: There is no execution.
de: Es gibt keine Ausführung.

source: Clean up execution(s)
de: Ausführung(en) aufräumen

source: execution(s) cleaned up.
de: Ausführung(en) wurden aufgeräumt.

source: Export stream(s)
de: Exportiere Stream(s)

source: You can create an export of your selected streams.LINE_BREAK This operation will generate and download a JSON file.
de: Sie können einen Export von Ihren ausgewählten Streams erstellen.LINE_BREAK Diese Operation wird eine JSON Datei generieren und zum Download zur Verfügung stellen.

source: Exporting stream(s) ...
de: Exportiere Stream(s) ...

source: Cancel
de: Abbrechen

source: No stream selected
de: Kein Stream ausgewählt

source: Please, select stream(s) to export.
de: Bitte wählen Sie Stream(s) zum Exportieren aus.

source: Stream(s) export
de: Stream(s) exportieren

source: Stream(s) has been exported.
de: Stream(s) wurden exportiert.

source: Import stream(s)
de: Stream(s) importieren

source: You can import your streams from a JSON file.LINE_BREAK The file needs to be modified for sensitive properties before importing.
de: Sie können Streams von einer JSON Datei importieren.LINE_BREAK Die Datei muss vor dem Import wegen sensitiver Eigenschaften angepasst werden.

source: JSON file
de: JSON Datei

source: Select a file
de: Wähle eine Datei aus

source: Options
de: Optionen

source: Optimize
de: Optimieren

source: File:
de: Datei:

source: Duration:
de: Dauer:

source: error(s)
de: Fehler(s)

source: Description
de: Beschreibung

source: Message:
de: Nachricht:

source: stream(s) created
de: Stream(s) erstellt

source: Importing stream(s) ...
de: Importiere Stream(s) ...

source: Export task(s)
de: Exportiere Task(s)

source: You can create an export of your selected tasks.LINE_BREAK This operation will generate and download a JSON file.
de: Sie können einen Export von ihren ausgewählten Tasks erstellen.LINE_BREAK Diese Operation wird eine JSON Datei generieren und zum Download zur Verfügung stellen.

source: Exporting task(s) ...
de: Exportiere Task(s) ...

source: Cancel
de: Abbrechen

source: Import task(s)
de: Importiere Task(s)

source: You can import your tasks from a JSON file.LINE_BREAK The file needs to be modified for sensitive properties before importing.
de: Sie können ihre Tasks von einer JSON Datei importieren.LINE_BREAK Die Datei muss vor dem Import wegen sensitiver Eigenschaften angepasst werden.

source: Exclude children
de: Kind-Elemente ausschließen

source: task(s) created
de: Task(s) erstellt

source: Importing task(s) ...
de: Importiere Task(s) ...

source: Export stream(s): Create a JSON file with the selected streams
de: Exportiere Stream(s): Erstellt eine JSON-Datei basierend auf den ausgewählten Streams

source: Import stream(s): Import streams from a JSON file
de: Importiere Stream(s): Importiere Streams von einer JSON-Datei

source: Clean up all task/job executions
de: Räume alle Aufgabe/Job-Ausführungen auf

source: Clean up all completed task/job executions
de: Räume alle beendeten Aufgabe/Job-Ausführungen auf

source: Export task(s): Create a JSON file with the selected tasks
de: Exportiere Task(s): Erstellt eine JSON-Datei basierend auf den ausgewählten Aufgaben

source: Import task(s): Import tasks from a JSON file
de: Importiere Task(s): Importiere Tasks von einer JSON-Datei

source: Authentication required
de: Authentifizierung benötigt

source: Please sign in.
de: Bitte melden Sie sich an.

source: Feature Disabled
de: Feature Deaktiviert

source: The requested feature is disabled on the server.
de: Das angefragte Feature ist auf dem Server deaktiviert.

source: Roles Missing
de: Rolle fehlt

source: It appears that you are missing the proper roles. Please contact your administrator to rectify the situation.
de: Es scheint als ob nötige Rollen fehlen. Bitte kontaktieren Sie ihren Administrator um die Situation zu klären.

source: Settings
de: Einstellungen

source: default
de: standard

source: You can choose between dark and default theme
de: Sie können zwischen einem dunklen oder dem standard Theme wählen

source: Results
de: Ergebnisse

source: You can choose the number of results per page.
de: Sie können die Anzahl an Ergebnissen pro seite auswählen.

source: Close
de: Schließen

source: Confirm action
de: Bestätige Aktion

source: Yes
de: Ja

source: Import a file
de: Importiere eine Datei

source: Copy to the clipboard
de: Kopiere in die Zwischenablage

source: Content copied
de: Inhalt kopiert

source: The content have been copied to your clipboard.
de: Der Inhalt wurde in die Zwischenablage kopiert.

source: Invalid key/value property
de: Ungültige Schlüssel/Wert Eigenschaft

source: Search for keywords ...
de: Suche in Schlüsselworten ...

source: Searching for results...
de: Suche nach Ergebnissen...

source: There are no search results for
de: Es liegen keine Suchergebnisse vor für

source: Application(s)
de: Anwendung(en)

source: Streams(s)
de: Stream(s)

source: Task(s)
de: Aufgabe(en)

source: Invalid dates.
de: Ungültige Daten.

source: Min date:
de: Min Datum:

source: Max date:
de: Max Datum:
