Repository: klopfdreh/spring-cloud-dataflow-ui
Catalog: ui/src/locale/messages.*.xlf
Languages: de

source: Instances for app
de: Instanzen für Anwendung

source: Instance
de: Instanz

source: Close
de: Schließen

source: instances
de: Instanzen

source: instance
de: Instanz

source: View details
de: Details anzeigen

source: There are currently
de: Es sind derzeit

source: no applications running
de: keine laufenden Anwendungen vorhanden

source: Loading runtime...
de: Lade Laufzeit...

source: Clone Stream
de: Klone Stream

source: Clone Streams
de: Klone Streams

source: This action will create the following
de: Diese Aktion wird die folgenden

source: Duplicate stream name, please check input names.
de: Dupliziere Stream-Namen, bitte Eingabenamen überprüfen.

source: Stream name is required.
de: Stream-Name wird benötigt.

source: Invalid stream name (no space or special charaters).
de: Ungültiger Stream-Name (keine Leer-/Sonderzeichen).

source: Stream name must be less than 255 characters long.
de: Stream-Name muss weniger als 255 Zeichen lang sein.

source: Stream name is already taken.
de: Stream-Name wurde bereits verwendet.

source: Cloning stream(s)...
de: Klone Stream(s)...

source: Clone the stream
de: Klone den Stream

source: Clone the streams
de: Klone die Streams

source: Stream(s) clone
de: Stream(s) klonen

source: Stream(s) have been cloned partially
de: Stream(s) wurde teilweise geklont

source: Stream(s) have been cloned successfully
de: Stream(s) wurde erfolgreich geklont

source: Error(s) occurred
de: Fehler aufgetreten

source: No stream(s) cloned.
de: Keine Stream(s) geklont.

source: Create stream(s)
de: Erstelle Stream(s)

source: Creating Stream(s)...
de: Erstelle Stream(s)...

source: Stream name is required!
de: Stream-Name wird benötigt!

source: Stream name is already taken!
de: Stream-Name wurde bereits verwendet!

source: Stream name must be less than 255 characters long!
de: Stream-Name muss weniger als 255 betragen!

source: Stream description must be less than 255 characters long!
de: Stream Beschreibung muss kürzer als 255 Zeichen sein!

source: Create the stream(s)
de: Erstelle den/die Stream(s)

source: Invalid stream(s)
de: Ungültige(r) Stream(s)

source: Stream(s) creation
de: Stream(s) Erstellen

source: Stream(s) have been created successfully
de: Stream(s) wurde(n) erfolgreich erstellt

source: The define platform is not valid (unknown).
de: Die definierte Plattform ist nicht gültig (unbekannt).

source: Platform
de: Plattform

source: Generic Deployer Properties
de: Generische Deployer Eigenschaften

source: Key:
de: Schlüssel:

source: Value (application
de: Wert (Anwendung

source: Generated property:
de: Generierte Eigenschaft:

source: Deployment Platform
de: Deployment Plattform

source: Properties
de: Eigenschaften

source: Applications Properties
de: Anwendungs Eingeschaften

source: (invalid)
de: (ungültig)

source: properties
de: Eingeschaften

source: Edit
de: Editieren

source: Edit
de: Editieren

source: Edit
de: Editieren

source: No properties
de: Keine Eigenschaften

source: Loading ...
de: Lade ...

source: Error loading
de: Fehler beim Laden

source: Invalid version
de: Ungültige Version

source: Export
de: Exportieren

source: Copy to Clipboard
de: In die Zwischenablage kopieren

source: Update stream
de: Aktualisiere Stream

source: The field "property" is not valid.
de: Das Feld "property" ist nicht gültig.

source: The field "global" is not valid.
de: Das Feld "global" is nicht gültig.

source: The field
de: Das Feld

source: Deployment properties for platform
de: Deployment Eingeschaften für die Plattform

source: Some field(s) are invalid.
de: Einige Felder sind nicht valide.

source: Update
de: Aktualisieren

source: Please specify any optional deployment properties. You can either use the builder.
de: Bitte geben Sie ein optionale Deployment-Eingeschaft an. Sie können den Builder verwenden.

source: Alternatively, you can point to an external properties file containing the deployment properties. For more information please see the Technical Documentation.
de: Alternativ können Sie eine externe Eigenschaft-Datei mit Deployment-Eigenschaften angeben. Weitere Informationen finden sie in der technischen Dokumentation.

source: Freetext
de: Freitext

source: Loading data ...
de: Lade Daten ...

source: Enter the list of properties into the text area field below. Alternatively, you can also select a file in your local file system, which is used to populate the text area field.
de: Geben Sie eine Liste von Eigenschaften in das Textfeld an. Alternativ können Sie eine Datei vom lokalen Dateisystem wählen, welche in das Textfeld übernommen wird.

source: Import a local file
de: Importiere eine lokale Datei

source: Please provide a text file containing properties. This will be used to populate the text area above.
de: Bitte stellen Sie eine Textdatei mit Eingeschaften zur Verfügung. Diese Eigenschaft werden im überliegenden Textfeld verwendet.

source: Export
de: Exportieren

source: Copy to Clipboard
de: In die Zwischenablage kopieren

source: Deploy the stream
de: Deploy den Stream

source: Update the stream
de: Aktualisiere den Stream

source: Invalid properties
de: Ungültige Eingeschaften

source: Some line(s) are invalid.
de: Einige Zeilen sind ungültig.

source: Confirm Destroy Stream
de: Bestätigen Sie das Löschen des Stream

source: Confirm Destroy Streams
de: Bestätigen Sie das Löschen der Streams

source: This action will destroy and delete the stream
de: Diese Aktion wird den Stream zerstören und löschen

source: This action will destroy the
de: Diese Aktion zerstört die

source: stream definitions
de: Stream Definitionen

source: listed below. Are you sure?
de: unterhalb aufgeführt. Sind Sie sicher?

source: Destroying stream(s) ...
de: Zerstöre Stream(s) ...

source: Destroy the stream
de: Zerstöre den Stream

source: Destroy the streams
de: Zerstöre die Streams

source: Destroy stream
de: Zerstöre Stream

source: Successfully removed stream "
de: Stream wurde erfolgreich entfernt "

source: Destroy streams
de: Zerstöre Streams

source: stream(s) destroyed.
de: Stream(s) zerstört.

source: An error occurred while bulk deleting Streams. Please check the server logs for more details.
de: Ein Fehler ist beim gesammelten Löschen der Streams aufgetreten. Bitte prüfen Sie die Server Logs für mehr Informationen.

source: Select a platform.
de: Wählen Sie eine Plattform aus.

source: One or more arguments are invalid.
de: Eine oder mehr Argumente sind ungültig.

source: Deploy the streams
de: Deploy die Streams

source: Deploy success
de: Deploy erfolgreich

source: Successfully deployed
de: erfolgreich deployed

source: Confirm stream rollback
de: Bestätige Sie das Zurückrollen des Streams

source: This action will rollback the stream
de: Diese Aktion wird den Stream zurückrollen

source: to the version
de: zur Version

source: Are you sure?
de: Sind sie sicher?

source: Rollback stream(s) ...
de: Zurückrollen Stream(s) ...

source: Rollback
de: Zurückrollen

source: Rollback success
de: Zurückrollen erfolgreich

source: Successful stream rollback to version
de: Stream erfolgreich zur Version zurückrollen

source: Deployment has been initiated
de: Deployment wurde initiiert

source: Fully deployed based on each of the stream's apps' count properties
de: Vollständig deployed basierend auf jeder zugehörigen Stream's apps' Eingeschaften Anzahl

source: 1 or more of the apps are not yet deployed.
de: 1 oder mehr Anwendung wurde noch nicht deployed.

source: At least 1 of each app, but 1 or more of them not at requested capacity
de: Mindestens 1 oder mehr von jeder Anwendung nicht mit der angeforderten Kapazität

source: 1 or more of the apps does not have even a single instance deployed
de: 1 oder mehr Anwendungen haben nicht eine einzelne Instanz deployed

source: Intentionally undeployed, or created but not yet deployed
de: Absichlich undeployed, oder erstellt aber nicht deployed

source: Close
de: Schließen

source: Update stream
de: Aktualisiere Stream

source: Destroy stream
de: Zerstöre stream

source: Loading applications...
de: Lade Anwendungen...

source: Loading deployment info...
de: Lade deployment informationen...

source: instance(s)
de: Instanz(en)

source: View Log
de: Log ansehen

source: Date
de: Datum

source: Rollback
de: Zurückrollen

source: There is no history yet.
de: Es gibt noch keine Historie.

source: Loading stream...
de: Lade Stream...

source: No log.
de: Kein Log.

source: Loading log(s)...
de: Lade Log(s)...

source: Close
de: Schließen

source: Create stream(s)
de: Erstelle Stream(s)

source: Destroy stream(s)
de: Zerstöre Stream(s)

source: Clone stream(s)
de: Klone Stream(s)

source: Description
de: Beschreibung

source: Update
de: Aktualisiere

source: Destroy
de: Zerstöre

source: Clone
de: Klone

source: Streams per page
de: Streams pro Seite

source: Confirm Undeploy Stream
de: Bestätige Undeploy Stream

source: Confirm Undeploy Streams
de: Bestätige Undeploy Streams

source: This action will undeploy the stream
de: Diese Aktion wird den Stream undeployen

source: This action will undeploy the
de: Diese Aktion wird folgendes undeployen:

source: Undeploy the stream
de: Undeploy den Stream

source: Undeploy the streams
de: Undeploy die Streams

source: This action will remove the data of the task execution
de: Diese Aktion wird die Daten aus der Aufgaben-Ausführung entfernen

source: (task
de: (Aufgabe

source: ). Are you sure?
de: ). Sind Sie sicher?

source: This action will remove the data of the
de: Diese Aktion wird die Daten entfernen:

source: task executions
de: Aufgaben-Ausführungen

source: listed below. Are you sure?
de: unterhalb aufgeführt. Sind Sie sicher?

source: Execution ID
de: Ausführungs-ID

source: Task
de: Aufgabe

source: Clean up Task Execution
de: Aufgabe-Ausführung aufräumen

source: Clean up Task Executions
de: Aufgaben-Ausführung aufräumen

source: Clean up task execution(s)
de: Aufräumen der Aufgaben-Ausführung(en)

source: task execution(s) cleaned up.
de: Aufgaben-Ausführung(en) aufräumen.

source: Relaunch task
de: Aufgabe neustarten

source: Stop execution
de: Stoppe Ausführung

source: Clean up task execution
de: Aufräumen der Aufgaben-Ausführung

source: Execution Id
de: Ausführungs-Id

source: Arguments
de: Argumente

source: External Execution Id
de: Externe Ausführungs-Id

source: Job Execution Ids
de: Job Ausführungs-Ids

source: Start Time
de: Start-Zeit

source: End Time
de: End-Zeit

source: Duration
de: Dauer

source: Exit Message
de: Exit Nachricht

source: Resource URL
de: Ressourcen-URL

source: Application Properties
de: Anwendungs-Eingeschaften

source: Platform Properties
de: Plattform-Eingeschaften

source: No execution yet.
de: Es gibt keine Ausführung derzeit.

source: View log
de: Log einsehen

source: Loading application(s)...
de: Lade Anwendun(en)...

source: No task found.
de: Keine Aufgabe gefunden.

source: Loading task...
de: Lade Aufgabe...

source: View task
de: Aufgabe ansehen

source: Relaunch Task
de: Aufgabe neustarten

source: Loading execution...
de: Lade Ausführung...

source: Loading logs...
de: Lade Logs...

source: Task executions
de: Aufgaben-Ausführungen

source: Clean Up task execution(s)
de: Task-Ausführung(en) aufräumen

source: Execution ID
de: Ausführungs-ID

source: Task name
de: Aufgaben-Name

source: Duration
de: Dauer

source: Start Date
de: Start-Datum

source: End Date
de: End-Datum

source: Task details
de: Aufgaben-Details

source: Relaunch task
de: Aufgabe neustarten

source: Stop task
de: Aufgabe stoppen

source: Clean up task execution
de: Aufgaben-Ausführung aufräumen

source: Task executions per page
de: Aufgaben pro Seite

source: Confirm Stop Task Execution
de: Bestätige die Aufgaben-Ausführung

source: This action will stop the task execution
de: Diese Aktion wird die Aufgaben-Ausführung stoppen

source: Stopping task execution...
de: Stoppe Aufgaben-Ausführung...

source: Stop Task Execution(s)
de: Stoppe Aufgaben-Ausführung(en)

source: Job execution
de: Job-Ausführung

source: Restart the job
de: Starte den Job neu

source: Stop the job
de: Stoppe den Job

source: Job Instance
de: Job-Instanz

source: Task Execution Id
de: Aufgaben-Ausführungs-Id

source: Job Parameters
de: Job-Parameter

source: Step Execution Count
de: Schritt-Ausführungs-Anzahl

source: View task execution
de: Aufgaben-Ausführung anzeigen

source: Step Id
de: Schritt-Id

source: Step Name
de: Schritt-Name

source: Reads
de: Lesevorgänge

source: Writes
de: Schreibvorgänge

source: Rollbacks
de: Zurückroll-Vorgänge

source: Loading job execution...
de: Lade Job-Ausführung...

source: This action will restart the steps failed of the job execution
de: Diese Aktion wird fehlgeschlagene Schritte in der Job-Ausführung neustarten

source: This action will stop the job execution
de: Diese Aktion wird die Job-Ausführung stoppen

source: Restart job
de: Job neustarten

source: Successfully restarted job
de: Job erfolgreich neugestartet

source: Stop job
de: Stoppe Job

source: Successfully stopped job
de: Job erfolgreich gestoppt

source: Jobs
de: Job-Ausführungen

source: Execution Id
de: Ausfürungs-Id

source: Task Id
de: Aufgaben-Id

source: Instance Id
de: Instanz-Id

source: Job Start Time
de: Job-Start-Zeit

source: Step Execution Count
de: Schritt-Ausfürungs-Anzahl

source: Restart
de: Neustart

source: Stop
de: Stopp

source: Job executions per page
de: Job-Ausführungen pro Seite

source: job executions
de: Job-Ausführungen

source: No Step Execution available.
de: Keine Schritt-Ausfürung verfügbar.

source: Step Execution Id
de: Schritt-Ausführungs-Id

source: Job Execution Id
de: Job-Ausführungs-Id

source: Step Type
de: Schritt-Typ

source: Filter Count
de: Filter-Anzahl

source: Process Skips
de: Prozess-Übersprünge

source: Read Skips
de: Lese-Übersprünge

source: Skips
de: Übersprünge

source: Write Skips
de: Schreib-Übersprünge

source: No step execution context
de: Kein Schritt-Ausfürungs-Kontext

source: Count
de: Anzahl

source: Standard Deviation
de: Standard Abweichung

source: Duration per Read
de: Dauer pro Lesevorgang

source: Process Skip Count
de: Prozess-übersprung-Anzahl

source: Read Count
de: Lese-Anzahl

source: Read Skip Count
de: Lese-Übersprung-Anzahl

source: Rollback Count
de: Zurückroll-Anzahl

source: Write Count
de: Schreibe-Anzahl

source: Write Skip Count
de: Schreibe-Übersprung-Anzahl

source: N/A
de: n.v.

source: Loading job step execution...
de: Lade Job-Schrit-Ausfürung...

source: Schedule name
de: Zeitplan-Name

source: The name is required.
de: Der Name wird benötigt.

source: The name already exists.
de: Der Name existiert bereits.

source: Duplicate schedule name on the form.
de: Duplizierter Zeitplan-Name auf dem Formular.

source: Schedule
de: Zeitplan

source: The platform is required.
de: Die Plattform wird benötigt.

source: Cron Expression
de: Zeitangaben-Ausdruck

source: The cron expression is required.
de: Der Zeitangaben-Ausdruck wird benötigt.

source: Arguments can be prefixed by
de: Argumente können vorangestellt werden mit

source: Parameters should start with an
de: Parameter müssen folgendermaßen starten:

source: or
de: oder

source: One or more parameters are invalid.
de: Einer oder mehr Parameter sind nicht gültig.

source: Create schedule(s)
de: Erstelle Zeitpläne

source: Creating schedule(s)...
de: Erstelle Zeitpläne...

source: Schedule creation
de: Zeitplan-Erstellung

source: Successfully schedule creation
de: Erfolgreiche Zeitplan-Erstellung

source: Schedules creation
de: Zeitplan-Erstellung

source: Successfully
de: erfolgreich

source: schedules creation
de: Zeitplan-Erstellung

source: Confirm Delete Schedule
de: Bestätige das Löschen eines Zeitplans

source: Confirm Delete Schedules
de: Bestätige das Löschen von Zeitplänen

source: This action will delete the schedule
de: Diese Aktion wird den Zeitplan löschen

source: This action will delete the
de: Diese Aktion wird folgendes löschen:

source: schedule
de: Zeitplan

source: Task name
de: Aufgaben-Name

source: Deleting schedule(s) ...
de: Lösche Zeitpläne ...

source: Delete the schedule
de: Lösche den Zeitplan

source: Delete the schedules
de: Lösche die Zeitpläne

source: Delete schedule(s)
de: Lösche Zeitpläne

source: schedule(s) deleted.
de: Zeitpläne gelöscht.

source: An error occurred while deleting schedule(s). Please check the server logs for more details.
de: Ein Fehler ist beim Löschen der Zeitpläne aufgetreten. Bitte überprüfe die Server-Logs für mehr Informationen.

source: Task details
de: Aufgaben-Details

source: Delete schedule
de: Lösche Zeitpläne

source: Cron Expr.
de: Zeitangaben-Ausdruck

source: Loading schedule...
de: Lade Zeitpläne...

source: Delete schedules(s)
de: Lösche Zeitpläne

source: Platform
de: Plattform

source: Cron Expression
de: Zeitangaben-Ausdruck

source: Add new schedule
de: Neuen Zeitplan hinzufügen

source: schedules
de: Zeitpläne

source: Confirm Clean Up Execution(s)
de: Bestätige das Aufräumen der Ausführung(en)

source: Please, selected the status of the execution to remove:
de: Bitte wählen Sie den Status der Ausführung zum enternen aus:

source: All the
de: Alle die

source: execution(s) completed
de: Ausführung(en) beendet

source: There is no execution for this task.
de: Es gibt keine Ausführungen für diese Aufgabe.

source: Clone Task
de: Klone Aufgabe

source: Clone Tasks
de: Klone Aufgaben

source: task(s)
de: Aufgabe(en)

source: Duplicate task name, please check input names.
de: Dupliziere Aufgaben-Name, bitte prüfen Sie die Eingabe-Namen.

source: Task name is required.
de: Aufgaben-Name wird benötigt.

source: Invalid task name (no space or special charaters).
de: Ungültiger Aufgaben-Name (Keine Leerzeichen/Sonderzeichen erlaubt).

source: Task name must be less than 255 characters long.
de: Aufgaben-Name muss weniger als 255 Zeichen lang sein.

source: Task name is already taken.
de: Aufgaben-Name wird bereits verwendet.

source: Cloning task(s)...
de: Klone Aufgabe(n)...

source: Clone the task
de: Klone die Aufgabe

source: Clone the tasks
de: Klone die Aufgaben

source: Task(s) clone
de: Aufgabe(n) klonen

source: Task(s) have been cloned partially
de: Aufgabe(n) wurden teilweise geklont

source: Task(s) have been cloned successfully
de: Aufgabe(n) wurde(n) erfolgreich geklont

source: No task(s) cloned.
de: Keine Aufgabe(N) geklont.

source: Cancel
de: Abbrechen

source: Create task
de: Erstelle Aufgabe

source: Create task
de: Erstelle Aufgabe

source: Creating task...
de: Erstelle Aufgabe...

source: Create the task
de: Erstelle die Aufgabe

source: task
de: Aufgabe

source: The task definition name should be less than 63 characters for Kubernetes or Cloud Foundry platforms.
de: Der Aufgaben-Definitions-Name muss weniger als 63 Zeichen für Kubernetes oder Cloud Foundry Plattformen betragen.

source: Task name is required!
de: Aufgaben-Name wird benötigt!

source: Task name is already taken!
de: Aufgaben-Name wird bereits verwendet!

source: Task task name!
de: Aufgaben Aufgaben-Name!

source: Task name must be less than 256 characters long!
de: Aufgaben-Name muss kürzer als 256 Zeichen lang sein!

source: Task description must be less than 255 characters long!
de: Aufgaben-Beschreibung muss kürzer als 255 Zeichen lang sein!

source: Task creation
de: Aufgaben-Erstellung

source: Task Definition created for
de: Aufgaben-Definition erstellt für

source: Please, enter a valid task.
de: Bitte geben Sie eine valide Aufgabe an.

source: Confirm Destroy Task
de: Bestätige das Zerstören der Aufgaben

source: Confirm Destroy Tasks
de: Bestätige das Zerstören der Aufgaben

source: This action will destroy and delete the task
de: Diese Aktion wird die Aufgabe zerstören und löschen

source: Destroying task(s) ...
de: Zerstöre Aufgabe(n) ...

source: Destroy the task
de: Zerstöre die Aufgabe

source: Destroy the tasks
de: Zerstöre die Aufgaben

source: Destroy task(s)
de: Zerstöre Aufgabe(n)

source: task definition(s) destroyed.
de: Aufgaben-Definition(en) zerstört.

source: An error occurred while destroying tasks. Please check the server logs for more details.
de: Ein Fehler ist beim zerstören der Aufgabe aufgetreten. Bitte prüfen Sie die Server-Logs für mehr Informationen.

source: There are properties which can be migrated.
de: Es gibt Eingeschaften welche migriert werden können.

source: Migrate
de: Migriere

source: Platform
de: Plattform

source: Generic Deployer Properties
de: Generische-Deployer-Eingeschaften

source: Properties
de: Eingeschaften

source: Ctr Properties
de: Ctr Eingeschaften

source: Select a value
de: Wert auswählen

source: Error Loading
de: Fehler beim Laden

source: Launch task
de: Starte Aufgabe

source: Enter the list of arguments into the text area field below.
de: Geben Sie eine Liste an Argumenten in der unterhalb liegende Feld an.

source: Please provide a text file containing arguments. This will be used to populate the text area above.
de: Bitte geben Sie eine Text-Datei mit Argumenten an. Diese wird verwendet um Sie in das oberhalb liegende Textfeld zu übernehmen.

source: Launch Task
de: Aufgabe Starten

source: Freetext
de: Freitext

source: Launching task ...
de: Starte Aufgabe...

source: Launch task
de: Aufgabe starten

source: Schedule
de: Einplanung

source: Destroy task
de: Aufgabe zerstören

source: Cleanup
de: Aufräumen

source: Start time
de: Start-Zeit

source: End time
de: End-Zeit

source: Exit code
de: Ausgangs-Code

source: Loading execution(s)...
de: Lade Ausführung(en)...

source: No schedule yet.
de: keine Einplanung.

source: Loading schedule(s)...
de: Lade Einplanung(en)...

source: Log task execution
de: Log Aufgaben-Ausführung

source: Create task
de: Aufgabe erstellen

source: Schedule task(s)
de: Aufgabe(n) einplanen

source: Destroy task(s)
de: Aufgabe(n) zerstören

source: Clone task(s)
de: Aufgabe(n) klonen

source: Launch
de: Starten

source: Schedule
de: Einplanen

source: Cleanup
de: Aufräumen

source: Tasks per page
de: Aufgaben pro Seite

source: tasks
de: Aufgaben
